In [4]:
!pip install pandas

import pandas as pd

Requirement already satisfied: pandas in c:\users\suyas\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\suyas\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [18]:
df=pd.read_csv("data.csv")

df.head(5)
df.shape
df.rename(columns={"name":"Name"})

,order_id,customer,city,product,category,quantity,price,order_date
0,101,Amit,Delhi,Laptop,Electronics,1,55000,2024-01-10
1,102,Riya,Mumbai,Headphones,Electronics,2,2000,2024-01-12
2,103,Suresh,Bangalore,Chair,Furniture,4,3000,2024-01-15
3,104,Neha,Delhi,Table,Furniture,1,7000,2024-01-18
4,105,Amit,Delhi,Mouse,Electronics,3,800,2024-01-20
5,106,Riya,Mumbai,Laptop,Electronics,1,56000,2024-02-02
6,107,Karan,Pune,Desk,Furniture,2,12000,2024-02-05
7,108,Suresh,Bangalore,Keyboard,Electronics,1,1500,2024-02-10
8,109,Neha,Delhi,Headphones,Electronics,1,2200,2024-02-15
9,110,Amit,Delhi,Chair,Furniture,2,3200,2024-02-20

In [46]:
df[df["city"]=="Delhi"]

,order_id,customer,city,product,category,quantity,price,order_date,total_amount
0,101,Amit,Delhi,Laptop,Electronics,1,55000,2024-01-10,55000
3,104,Neha,Delhi,Table,Furniture,1,7000,2024-01-18,7000
4,105,Amit,Delhi,Mouse,Electronics,3,800,2024-01-20,2400
8,109,Neha,Delhi,Headphones,Electronics,1,2200,2024-02-15,2200
9,110,Amit,Delhi,Chair,Furniture,2,3200,2024-02-20,6400

In [25]:
pdf= df[(df["category"]=="Electronics") &  (df["city"]=="Delhi")] 
pdf[["city","customer","product","price"]]

    city customer     product  price
0  Delhi     Amit      Laptop  55000
4  Delhi     Amit       Mouse    800
8  Delhi     Neha  Headphones   2200

In [ ]:
df["total_amount"]=df[["price","quantity"]].apply(lambda x:x.quantity*x.price , axis=1)
df["total_amount"].sum()
df.groupby("city")["total_amount"].mean()
df.groupby("product")["quantity"].count()
df.groupby("customer")["total_amount"].sum().sort_values(ascending=False)

df.groupby("product")["total_amount"].sum().nlargest(2)
df.groupby("city")["total_amount"].sum()

city
Bangalore    13500
Delhi        73000
Mumbai       60000
Pune         24000
Name: total_amount, dtype: int64

:

In [29]:
df

,order_id,customer,city,product,category,quantity,price,order_date,total_amount
0,101,Amit,Delhi,Laptop,Electronics,1,55000,2024-01-10,55000
1,102,Riya,Mumbai,Headphones,Electronics,2,2000,2024-01-12,4000
2,103,Suresh,Bangalore,Chair,Furniture,4,3000,2024-01-15,12000
3,104,Neha,Delhi,Table,Furniture,1,7000,2024-01-18,7000
4,105,Amit,Delhi,Mouse,Electronics,3,800,2024-01-20,2400
5,106,Riya,Mumbai,Laptop,Electronics,1,56000,2024-02-02,56000
6,107,Karan,Pune,Desk,Furniture,2,12000,2024-02-05,24000
7,108,Suresh,Bangalore,Keyboard,Electronics,1,1500,2024-02-10,1500
8,109,Neha,Delhi,Headphones,Electronics,1,2200,2024-02-15,2200
9,110,Amit,Delhi,Chair,Furniture,2,3200,2024-02-20,6400